InformationRegisters/ФИОФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИнициалыИмени</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Инициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ФИОСлужебные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительКадровойСлужбы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйЗаБухгалтерскиеРегистры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйЗаВУР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйЗаСоставлениеДокументов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьСсылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравоПодписиПоДоверенности</Name>
					<Comment>Если Ложь - то это основное ответственное лицо, если Истина - то лицо, которое только имеет право подписи документов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПраваПодписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПраваПодписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаПраваПодписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаПраваПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОтветственныеЛицаСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает структуру, содержащую информацию об ответственном лице организации.
//
// Параметры:
//	Организация - СправочникСсылка.Организации - отбор по организации
//	Дата - Дата - отбор по дате
//  ОтветственноеЛицо - ПеречислениеСсылка.ОтветственныеЛицаОрганизаций - "вид" ответственного лица.
//
// Возвращаемое значение:
// 	Структура - Содержит ключи:
//		* СтруктурнаяЕдиница - СправочникСсылка.СтруктураПредприятия - 
//		* ОтветственноеЛицо - Перечисления.ОтветственныеЛицаОрганизаций - 
//		* ФизическоеЛицо - СправочникСсылка.ФизическиеЛица -
//		* Должность - СправочникСсылка.Должности - 
//
Функция ПолучитьДанныеОтветственногоЛица(Организация, Дата = Неопределено, ОтветственноеЛицо = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ОтветственноеЛицо) Тогда
		ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель;
	КонецЕсли;
	
	СтруктураОтветственных = ПолучитьОтветственныеЛицаОрганизации(Организация, Дата);
	Результат 			   = Новый Структура("СтруктурнаяЕдиница, ОтветственноеЛицо", Организация, ОтветственноеЛицо);
	
	Для Каждого МетаВидОтветственного Из Метаданные.Перечисления.ОтветственныеЛицаОрганизаций.ЗначенияПеречисления Цикл
		
		Ключ = МетаВидОтветственного.Имя;
		Если ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций[Ключ] Тогда
			Результат.Вставить("ФизическоеЛицо", СтруктураОтветственных[Ключ]);
			Результат.Вставить("Должность", 	 СтруктураОтветственных[Ключ + "Должность"]);
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру, содержащую информацию об ответственных лицах организации.
//
// Параметры:
//	Организация - СправочникСсылка.Организации - отбор по организации
//	Дата - Дата - отбор по дате.
//
// Возвращаемое значение:
// Структура - Содержит ключи
//	- %ВидОтветственного% - СправочникСсылка.ФизическиеЛица - физическое лицо, соответствующее ответственному лицу
//	- %ВидОтветственного%Должность - Строка - должность ответственного лица
// Для полей, начинающихся с %ВидОтветственного%
// 	- вместо %ВидОтветственного% подставляется имя значения перечисления ОтветственныеЛицаОрганизаций как оно задано в конфигураторе
//	- количество каждого из этих ключей соответствует количеству значений перечисления ОтветственныеЛицаОрганизаций.
//
Функция ПолучитьОтветственныеЛицаОрганизации(Организация, Дата = Неопределено) Экспорт
	
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	СтруктураОтветственных = Новый Структура;
	
	СтруктураОтбора 	 = Новый Структура("Дата, Владелец", Дата, Организация);
	ТаблицаОтветственных = ПолучитьТаблицуОтветственныхЛицПоОтбору(СтруктураОтбора);
	ТаблицаОтветственных.Индексы.Добавить("ОтветственноеЛицо, ПравоПодписиПоДоверенности");
	
	Для Каждого МетаВидОтветственного Из Метаданные.Перечисления.ОтветственныеЛицаОрганизаций.ЗначенияПеречисления Цикл
		
		Ключ 			  = МетаВидОтветственного.Имя;
		ВидОтветственного = Перечисления.ОтветственныеЛицаОрганизаций[Ключ];
		СтрокаТаблицы 	  = Неопределено; // ответственный пока не определен
		
		// Попытаемся найти подходящее ответственное лицо
		СтруктураОтбора = Новый Структура("ОтветственноеЛицо", ВидОтветственного);
		СтрокиТаблицы = ТаблицаОтветственных.НайтиСтроки(СтруктураОтбора);
		
		Если СтрокиТаблицы.Количество() = 1 Тогда
			
			// Если есть только один ответственный данного вида - вернем его
			СтрокаТаблицы = СтрокиТаблицы[0];
			
		ИначеЕсли СтрокиТаблицы.Количество() > 1 Тогда
			
			СтруктураОтбора.Вставить("ПравоПодписиПоДоверенности", Ложь);
			
			СтрокиТаблицы = ТаблицаОтветственных.НайтиСтроки(СтруктураОтбора);
			Если СтрокиТаблицы.Количество() = 1 Тогда
				// Если есть основной ответственный данного вида - вернем его
				СтрокаТаблицы = СтрокиТаблицы[0];
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрокаТаблицы = Неопределено Тогда
			
			// Ответственное лицо этого вида не удалось определить
			СтруктураОтветственных.Вставить(Ключ, 				         Справочники.ФизическиеЛица.ПустаяСсылка());
			СтруктураОтветственных.Вставить(Ключ + "Должность",          "");
			СтруктураОтветственных.Вставить(Ключ + "ДолжностьСсылка",    Неопределено);
			СтруктураОтветственных.Вставить(Ключ + "Наименование",       "");
			СтруктураОтветственных.Вставить(Ключ + "Ссылка", 	         Справочники.ОтветственныеЛицаОрганизаций.ПустаяСсылка());
		Иначе
			
			// Основное ответственное лицо этого вида найдено
			СтруктураОтветственных.Вставить(Ключ, 				         СтрокаТаблицы.ФизическоеЛицо);
			СтруктураОтветственных.Вставить(Ключ + "Должность",          СтрокаТаблицы.Должность);
			СтруктураОтветственных.Вставить(Ключ + "ДолжностьСсылка",    СтрокаТаблицы.ДолжностьСсылка);
			СтруктураОтветственных.Вставить(Ключ + "Наименование",       СтрокаТаблицы.Наименование);
			СтруктураОтветственных.Вставить(Ключ + "Ссылка", 	         СтрокаТаблицы.Ссылка);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтруктураОтветственных;
	
КонецФункции

// Возвращает таблицу ответственных лиц, сформированную в соответствии с произвольным отбором.
//
// Параметры:
//  Отбор - Структура - структура, содержащая параметры отбора данных справочника ОтветственныеЛицаОрганизаций.
//		Ключ - имя реквизита справочника. Возможны дополнительные ключи:
//			- Дата 		  - для отбора по периоду ДатаНачала - ДатаОкончания
//			- Организация - синоним ключа Владелец
//		Значение - значение для отбора по ключу
//	ДопустимыПомеченныеНаУдаление - Булево - выводить в результирующую таблицу помеченные на удаление элементы.
//
// Возвращаемое значение:
//	ТаблицаЗначений - Содержит колонки:
//		* Ссылка - СправочникСсылка.ОтветственныеЛицаОрганизаций - 
//		* Владелец - СправочникСсылка.Организации - 
//		* ОтветственноеЛицо - ПеречислениеСсылка.ОтветственныеЛицаОрганизаций -
//		* ФизическоеЛицо - СправочникСсылка.ФизическиеЛица - 
//		* ДолжностьСсылка - СправочникСсылка.Должности -
//		* Должность - Строка -
//		* ПравоПодписиПоДоверенности - Булево - 
//		* ОснованиеПраваПодписи - Строка -
//		* ДатаНачала - Дата -
//		* ДатаОкончания - Дата -
//		* ДокументПраваПодписи - Строка - 
//		* НомерДокументаПраваПодписи - Строка - 
//		* ДатаДокументаПраваПодписи - Дата -
//
Функция ПолучитьТаблицуОтветственныхЛицПоОтбору(Знач Отбор, ДопустимыПомеченныеНаУдаление = Ложь, СтрокаПоиска = "") Экспорт
	
	Запрос = Новый Запрос;
	
	ТекстВыбираемыеПоля = "";
	ТекстОтбора = "";
	НомерОтбора = 0;
	
	ПоляОтбора = ЗначениеНастроекПовтИсп.РеквизитыСправочника("ОтветственныеЛицаОрганизаций");
	
	Если Отбор.Свойство("Дата") Тогда
		
		// Отбор по периоду действия записи об ответственном лице
		ТекстОтбора =
			ТекстОтбора
			+ ?(ТекстОтбора = "", "", " И ") + "ОтветственныеЛицаОрганизаций.ДатаНачала <= &ОтборПоДате
			| И (ОтветственныеЛицаОрганизаций.ДатаОкончания >= &ОтборПоДате 
			|	 ИЛИ ОтветственныеЛицаОрганизаций.ДатаОкончания = ДАТАВРЕМЯ(1,1,1,0,0,0))
			|";
		Запрос.УстановитьПараметр("ОтборПоДате", НачалоДня(Отбор.Дата));
		
		Отбор.Удалить("Дата");
		
	КонецЕсли;
	
	Если Отбор.Свойство("Организация") Тогда
		Отбор.Вставить("Владелец", Отбор.Организация);
		Отбор.Удалить("Организация");
	КонецЕсли;
	
	Если НЕ ДопустимыПомеченныеНаУдаление Тогда
		Отбор.Вставить("ПометкаУдаления", Ложь);
	КонецЕсли;
	
	// Формируем секцию запроса "ГДЕ", устанавливаем параметры запроса
	Для Каждого ТекущийОтбор Из Отбор Цикл
		
		Если НЕ ПоляОтбора.Свойство(ТекущийОтбор.Ключ) Тогда
			Продолжить;
		КонецЕсли;
		
		НомерОтбора = НомерОтбора + 1;
		
		ТекстОтбора =
			ТекстОтбора
			+ ?(ТекстОтбора = "", "", " И ") + "ОтветственныеЛицаОрганизаций." + ТекущийОтбор.Ключ 
				+ ?(ТипЗнч(ТекущийОтбор.Значение) = Тип("Массив") ИЛИ ТипЗнч(ТекущийОтбор.Значение) = Тип("ФиксированныйМассив"), " В ", " = ")
				+ "(&ЗначениеОтбора" + СокрЛП(НомерОтбора) + ")
			|";
		
		Запрос.УстановитьПараметр("ЗначениеОтбора" + СокрЛП(НомерОтбора), ТекущийОтбор.Значение);
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СтрокаПоиска) Тогда
		
		ТекстОтбора =
			ТекстОтбора
			+ ?(ТекстОтбора = "", "", " И ") + "ОтветственныеЛицаОрганизаций.Наименование ПОДОБНО &ОтборПоПредставлению
			|";
		Запрос.УстановитьПараметр("ОтборПоПредставлению", СтрокаПоиска + "%");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОтбора) Тогда
		ТекстОтбора =
			"ГДЕ
			| " + ТекстОтбора;
	КонецЕсли;
	
	Для Каждого Поле Из ПоляОтбора Цикл
		ТекстВыбираемыеПоля = ТекстВыбираемыеПоля
			+ ?(ТекстВыбираемыеПоля = "", "", ",") + "
			|ОтветственныеЛицаОрганизаций." + Поле.Ключ + " КАК " + Поле.Ключ;
	КонецЦикла;
	
	// Формируем запрос, получаем данные
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	%ТекстВыбираемыеПоля%
	|ИЗ
	|	Справочник.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
	|%ТекстОтбора%
	|УПОРЯДОЧИТЬ ПО
	|	Владелец,
	|	ОтветственноеЛицо,
	|	ПравоПодписиПоДоверенности,
	|	ДатаНачала,
	|	ДатаОкончания,
	|	ФизическоеЛицо";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ТекстВыбираемыеПоля%", ТекстВыбираемыеПоля);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ТекстОтбора%", 		  ТекстОтбора);
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Формирует временную таблицу, содержащую информацию об ответственных лицах в разрезе документов.
// Используется для формирования печатных форм документов подсистемой печати
//	- перед выборкой данных из шапки документа вызвать эту процедуру
//	- при выборке данных создать левое соединение таблицы документов с временной таблицей ТаблицаОтветственныеЛица по полю Ссылка.
//
// Параметры:
//	ОтборДокументы - Массив Из ДокументСсылка - ссылки на документы, по которым необходимо получить ответственных лиц.
//		Важно: если передан массив, то все его элементы должны иметь одинаковый тип.
//	МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - в него помещается сформированная временная таблица ТаблицаОтветственныеЛица
//  ИмяРеквизитаОрганизация - Строка - Имя поля документа для получения организации-владельца ответственного лица
//	РеквизитыОтветственныеЛица - Структура, Соответствие - В структуре:
//		* Ключ - Строка - имя поля в запросе для получения значения ответственного лица
//		* Значение - ПеречислениеСсылка.ОтветственныеЛицаОрганизаций - "вид" ответственного лица
//	ИмяТаблицыОтветственныеЛица - Строка - позволяет задать имя для формируемой временной таблицы.
// Количество строк в таблице "ТаблицаОтветственныеЛица" соответствует количеству элементов в ОтборДокументы.
//
// Структура временной таблицы "ТаблицаОтветственныеЛица"
//	- Ссылка - ссылка на документ из ОтборДокументы
//	- %Реквизит% - СправочникСсылка.ОтветственныеЛицаОрганизаций - значение реквизита ответственного лица из документа
//	- %Реквизит%ФизическоеЛицо - СправочникСсылка.ФизическиеЛица - физическое лицо, соответствующее ответственному лицу
//	- %Реквизит%Наименование - Строка - наименование для печати ответственного лица
//	- %Реквизит%Должность - Строка - должность ответственного лица
//	- %Реквизит%ОснованиеПраваПодписи - Строка - основание права подписи для неосновного ответственного лица
// Для полей, начинающихся с %Реквизит%
// 	- вместо %Реквизит% подставляется имя реквизита ответственного лица как оно задано в конфигураторе
//	- количество каждого из этих полей соответствует количеству реквизитов ответственных лиц документа.
//
// Например, если в метаданных документа есть два реквизита ответственных лиц - Руководитель и Бухгалтер,
// то таблица ТаблицаОтветственныеЛица будет иметь следующую структуру:
//	- Ссылка
//	- Руководитель
//	- РуководительФизическоеЛицо
//	- РуководительНаименование
//	- РуководительДолжность
//	- РуководительОснованиеПраваПодписи
//	- Бухгалтер
//	- БухгалтерФизическоеЛицо
//	- БухгалтерНаименование
//	- БухгалтерДолжность
//	- БухгалтерОснованиеПраваПодписи.
//
Процедура СформироватьВременнуюТаблицуОтветственныхЛицДокументов(ОтборДокументы, МенеджерВременныхТаблиц,
			ИмяРеквизитаОрганизация = "Организация", РеквизитыОтветственныеЛица = Неопределено,
			ИмяТаблицыОтветственныеЛица = "ТаблицаОтветственныеЛица") Экспорт
	
	Если (ТипЗнч(ОтборДокументы) = Тип("Массив") ИЛИ ТипЗнч(ОтборДокументы) = Тип("ФиксированныйМассив"))
	 И ОтборДокументы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ОтборДокументы) <> Тип("Массив") И ТипЗнч(ОтборДокументы) <> Тип("ФиксированныйМассив") Тогда // это ссылка на документ
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(ОтборДокументы);
	Иначе // это массив ссылок на документы
		МассивОбъектов = ОтборДокументы;
	КонецЕсли;
	
	МетаданныеДокумента = МассивОбъектов[0].Метаданные(); // ОбъектМетаданныхДокумент - 
	
	ИменаПолейПереданыВПараметрах = (РеквизитыОтветственныеЛица <> Неопределено);
	Если НЕ ИменаПолейПереданыВПараметрах Тогда
		РеквизитыОтветственныеЛица = ОтветственныеЛицаПовтИсп.РеквизитыОтветственныхЛицДокумента(МетаданныеДокумента.Имя);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РеквизитыОтветственныеЛица) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРеквизитаОрганизация = "ДокументДляПечати." + ИмяРеквизитаОрганизация;
	
	Если МенеджерВременныхТаблиц = Неопределено Тогда
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	// Получим данные из документов
	ШаблонЗапроса = 
	"ВЫБРАТЬ
	|	ДокументДляПечати.Ссылка 					КАК Ссылка,
	|	НАЧАЛОПЕРИОДА(ДокументДляПечати.Дата, ДЕНЬ) КАК Дата,
	|	%Организация%								КАК Организация,
	|	%ИмяРеквизита% 								КАК ВыбранноеОтветственноеЛицо,
	|	ЗНАЧЕНИЕ(%ОтветственноеЛицо%) 				КАК ОтветственноеЛицо
	|%СозданиеВременнойТаблицы%
	|ИЗ
	|	Документ." + МетаданныеДокумента.Имя + " КАК ДокументДляПечати
	|ГДЕ
	|	ДокументДляПечати.Ссылка В(&МассивОбъектов)";
	
	Индекс = 0;
	Для Каждого КлючИЗначение Из РеквизитыОтветственныеЛица Цикл
		
		Индекс 		 = Индекс + 1;
		ТекстЗапроса = ШаблонЗапроса;
		
		Если Индекс > 1 Тогда
			ТекстЗапроса = "
			|ОБЪЕДИНИТЬ ВСЕ
			|" + ТекстЗапроса;
		КонецЕсли;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса , "%Организация%", 			 	ИмяРеквизитаОрганизация);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса , "%ИмяРеквизита%", 			
			?(ИменаПолейПереданыВПараметрах, 
				"ЗНАЧЕНИЕ(Справочник.ОтветственныеЛицаОрганизаций.ПустаяСсылка)", // будут выбраны значения по умолчанию
				"ДокументДляПечати." + КлючИЗначение.Ключ));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса , "%ОтветственноеЛицо%", 		ПолучитьПолноеИмяПредопределенногоЗначения(КлючИЗначение.Значение));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса , "%СозданиеВременнойТаблицы%", ?(Индекс = 1, "ПОМЕСТИТЬ ВТДанныеДокументов", ""));
		
		Запрос.Текст = Запрос.Текст + ТекстЗапроса;
		
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + "
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ОтветственноеЛицо,
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	// Заполним пустые поля ответственных лиц значениями по умолчанию
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТДанныеДокументов.Организация КАК Организация,
	|	ВТДанныеДокументов.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	ВТДанныеДокументов.Дата КАК Дата
	|ПОМЕСТИТЬ ВТНезаполненныеОтветственные
	|ИЗ
	|	ВТДанныеДокументов КАК ВТДанныеДокументов
	|ГДЕ
	|	ВТДанныеДокументов.ВыбранноеОтветственноеЛицо = ЗНАЧЕНИЕ(Справочник.ОтветственныеЛицаОрганизаций.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ОтветственноеЛицо,
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНезаполненныеОтветственные.Организация КАК Организация,
	|	ВТНезаполненныеОтветственные.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	ВТНезаполненныеОтветственные.Дата КАК Дата,
	|	ОтветственныеЛицаОрганизаций.Ссылка КАК Ответственный,
	|	ОтветственныеЛицаОрганизаций.ПравоПодписиПоДоверенности КАК ПравоПодписиПоДоверенности
	|ПОМЕСТИТЬ ВТКандидатыВОтветственныеПоУмолчанию
	|ИЗ
	|	ВТНезаполненныеОтветственные КАК ВТНезаполненныеОтветственные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
	|		ПО ВТНезаполненныеОтветственные.Организация = ОтветственныеЛицаОрганизаций.Владелец
	|			И ВТНезаполненныеОтветственные.ОтветственноеЛицо = ОтветственныеЛицаОрганизаций.ОтветственноеЛицо
	|			И ВТНезаполненныеОтветственные.Дата >= ОтветственныеЛицаОрганизаций.ДатаНачала
	|			И (ВТНезаполненныеОтветственные.Дата <= ОтветственныеЛицаОрганизаций.ДатаОкончания
	|				ИЛИ ОтветственныеЛицаОрганизаций.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТКандидатыВОтветственныеПоУмолчанию.Организация,
	|	ВТКандидатыВОтветственныеПоУмолчанию.ОтветственноеЛицо,
	|	ВТКандидатыВОтветственныеПоУмолчанию.Дата,
	|	ВТКандидатыВОтветственныеПоУмолчанию.ОтветственноеЛицоПоУмолчанию
	|ПОМЕСТИТЬ ВТОтветственныеПоУмолчанию
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТКандидатыВОтветственныеПоУмолчанию.Организация КАК Организация,
	|		ВТКандидатыВОтветственныеПоУмолчанию.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|		ВТКандидатыВОтветственныеПоУмолчанию.Дата КАК Дата,
	|		ВТКандидатыВОтветственныеПоУмолчанию.Ответственный КАК ОтветственноеЛицоПоУмолчанию
	|	ИЗ
	|		ВТКандидатыВОтветственныеПоУмолчанию КАК ВТКандидатыВОтветственныеПоУмолчанию
	|	ГДЕ
	|		НЕ ВТКандидатыВОтветственныеПоУмолчанию.ПравоПодписиПоДоверенности
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТКандидатыВОтветственныеПоУмолчанию.Организация,
	|		ВТКандидатыВОтветственныеПоУмолчанию.ОтветственноеЛицо,
	|		ВТКандидатыВОтветственныеПоУмолчанию.Дата,
	|		МИНИМУМ(ВТКандидатыВОтветственныеПоУмолчанию.Ответственный)
	|	ИЗ
	|		ВТКандидатыВОтветственныеПоУмолчанию КАК ВТКандидатыВОтветственныеПоУмолчанию
	|
	|	СГРУППИРОВАТЬ ПО
	|		ВТКандидатыВОтветственныеПоУмолчанию.Организация,
	|		ВТКандидатыВОтветственныеПоУмолчанию.ОтветственноеЛицо,
	|		ВТКандидатыВОтветственныеПоУмолчанию.Дата
	|	
	|	ИМЕЮЩИЕ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТКандидатыВОтветственныеПоУмолчанию.Ответственный) = 1
	|	) КАК ВТКандидатыВОтветственныеПоУмолчанию
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ОтветственноеЛицо,
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДанныеДокументов.Ссылка,
	|	ВТДанныеДокументов.Дата,
	|	ВТДанныеДокументов.ОтветственноеЛицо,
	|	ВЫБОР
	|		КОГДА ВТДанныеДокументов.ВыбранноеОтветственноеЛицо = ЗНАЧЕНИЕ(Справочник.ОтветственныеЛицаОрганизаций.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(ВТОтветственныеПоУмолчанию.ОтветственноеЛицоПоУмолчанию, ЗНАЧЕНИЕ(Справочник.ОтветственныеЛицаОрганизаций.ПустаяСсылка))
	|		ИНАЧЕ ВТДанныеДокументов.ВыбранноеОтветственноеЛицо
	|	КОНЕЦ КАК ОтветственноеЛицоПоУмолчанию
	|ПОМЕСТИТЬ ВТДокументыСОтветственными
	|ИЗ
	|	ВТДанныеДокументов КАК ВТДанныеДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтветственныеПоУмолчанию КАК ВТОтветственныеПоУмолчанию
	|		ПО ВТДанныеДокументов.Организация = ВТОтветственныеПоУмолчанию.Организация
	|			И ВТДанныеДокументов.ОтветственноеЛицо = ВТОтветственныеПоУмолчанию.ОтветственноеЛицо
	|			И ВТДанныеДокументов.Дата = ВТОтветственныеПоУмолчанию.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТДокументыСОтветственными.ОтветственноеЛицоПоУмолчанию.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТДокументыСОтветственными.Ссылка,
	|	МАКСИМУМ(ФИОФизическихЛиц.Период) КАК Период
	|ПОМЕСТИТЬ ВТПериодыФИОФизЛиц
	|ИЗ
	|	ВТДокументыСОтветственными КАК ВТДокументыСОтветственными
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц КАК ФИОФизическихЛиц
	|		ПО ВТДокументыСОтветственными.ОтветственноеЛицоПоУмолчанию.ФизическоеЛицо = ФИОФизическихЛиц.ФизическоеЛицо
	|			И ВТДокументыСОтветственными.Дата >= ФИОФизическихЛиц.Период
	|ГДЕ
	|	ВТДокументыСОтветственными.ОтветственноеЛицоПоУмолчанию.ФизическоеЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	И ВТДокументыСОтветственными.ОтветственноеЛицоПоУмолчанию.ФизическоеЛицо ЕСТЬ НЕ NULL 
	|	И ФИОФизическихЛиц.Период ЕСТЬ НЕ NULL 
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДокументыСОтветственными.ОтветственноеЛицоПоУмолчанию.ФизическоеЛицо,
	|	ВТДокументыСОтветственными.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПериодыФИОФизЛиц.ФизическоеЛицо,
	|	ВТПериодыФИОФизЛиц.Ссылка,
	|	ВЫРАЗИТЬ(ФИОФизическихЛиц.Фамилия + ВЫБОР
	|			КОГДА ФИОФизическихЛиц.Имя = """"
	|				ТОГДА """"
	|			ИНАЧЕ "" "" + ФИОФизическихЛиц.Имя
	|		КОНЕЦ + ВЫБОР
	|			КОГДА ФИОФизическихЛиц.Отчество = """"
	|				ТОГДА """"
	|			ИНАЧЕ "" "" + ФИОФизическихЛиц.Отчество
	|		КОНЕЦ КАК СТРОКА(150)) КАК ПолноеФИО,
	|	ВЫРАЗИТЬ(ФИОФизическихЛиц.Фамилия + ВЫБОР
	|			КОГДА ФИОФизическихЛиц.Имя = """"
	|				ТОГДА """"
	|			ИНАЧЕ "" "" + ПОДСТРОКА(ФИОФизическихЛиц.Имя, 1, 1) + "".""
	|		КОНЕЦ + ВЫБОР
	|			КОГДА ФИОФизическихЛиц.Отчество = """"
	|				ТОГДА """"
	|			ИНАЧЕ ПОДСТРОКА(ФИОФизическихЛиц.Отчество, 1, 1) + "".""
	|		КОНЕЦ КАК СТРОКА(50)) КАК ФИО
	|ПОМЕСТИТЬ ВТФИОФизЛиц
	|ИЗ
	|	ВТПериодыФИОФизЛиц КАК ВТПериодыФИОФизЛиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц КАК ФИОФизическихЛиц
	|		ПО ВТПериодыФИОФизЛиц.ФизическоеЛицо = ФИОФизическихЛиц.ФизическоеЛицо
	|			И ВТПериодыФИОФизЛиц.Период = ФИОФизическихЛиц.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДокументыСОтветственными.Ссылка,
	|	ВТДокументыСОтветственными.ОтветственноеЛицо,
	|	ВТДокументыСОтветственными.ОтветственноеЛицоПоУмолчанию,
	|	ЕСТЬNULL(ВТФИОФизЛиц.ПолноеФИО, """") КАК ПолноеФИО,
	|	ЕСТЬNULL(ВТФИОФизЛиц.ФИО, """") КАК ФИО
	|ПОМЕСТИТЬ ВТДокументыСФИООтветственных
	|ИЗ
	|	ВТДокументыСОтветственными КАК ВТДокументыСОтветственными
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИОФизЛиц КАК ВТФИОФизЛиц
	|		ПО ВТДокументыСОтветственными.ОтветственноеЛицоПоУмолчанию.ФизическоеЛицо = ВТФИОФизЛиц.ФизическоеЛицо
	|			И ВТДокументыСОтветственными.Ссылка = ВТФИОФизЛиц.Ссылка";
	
	Запрос.Текст = Запрос.Текст + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	// Свернем результат - поместим всех ответственных в одну запись выборки запроса
	ШаблонЗапроса = "
	|ВЫБРАТЬ
	|	ВТДокументыСФИООтветственных.Ссылка%СтрокаВыборкаЗапроса%
	|ПОМЕСТИТЬ ВТДокументыСФИООтветственныхСвернутая
	|ИЗ
	|(%ВложенныйЗапрос%) КАК ВТДокументыСФИООтветственных
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДокументыСФИООтветственных.Ссылка
	|";
	
	ШаблонВложенногоЗапроса = "
	|ВЫБРАТЬ
	|	ВТДокументыСФИООтветственных.Ссылка%СтрокаВыборкаВложенногоЗапроса%
	|ИЗ
	|	ВТДокументыСФИООтветственных КАК ВТДокументыСФИООтветственных
	|ГДЕ
	|	ВТДокументыСФИООтветственных.ОтветственноеЛицо = ЗНАЧЕНИЕ(%ОтветственноеЛицо%)
	|";
	
	Индекс = 0;
	СтрокаВыборкаЗапроса = "";
	ТекстВложенногоЗапроса = "";
	
	Для Каждого КлючИЗначение Из РеквизитыОтветственныеЛица Цикл
		
		Индекс = Индекс + 1;
		
		СтрокаВыборкаВложенногоЗапроса = "";
		Для Каждого КлючИЗначение2 Из РеквизитыОтветственныеЛица Цикл
			
			Если КлючИЗначение.Ключ = КлючИЗначение2.Ключ Тогда
				СтрокаВыборкаВложенногоЗапроса = СтрокаВыборкаВложенногоЗапроса + ",
				|	ВТДокументыСФИООтветственных.ОтветственноеЛицоПоУмолчанию КАК " + КлючИЗначение2.Ключ + ",
				|	ВТДокументыСФИООтветственных.ПолноеФИО КАК " + КлючИЗначение2.Ключ + "ПолноеФИО,
				|	ВТДокументыСФИООтветственных.ФИО КАК " + КлючИЗначение2.Ключ + "ФИО";
			Иначе
				СтрокаВыборкаВложенногоЗапроса = СтрокаВыборкаВложенногоЗапроса + ",
				|	ЗНАЧЕНИЕ(Справочник.ОтветственныеЛицаОрганизаций.ПустаяСсылка) КАК " + КлючИЗначение2.Ключ + ",
				|	"""" КАК " + КлючИЗначение2.Ключ + "ПолноеФИО,
				|	"""" КАК " + КлючИЗначение2.Ключ + "ФИО";
			КонецЕсли;
			
		КонецЦикла;
		
		Если Индекс > 1 Тогда
			ТекстВложенногоЗапроса = ТекстВложенногоЗапроса + "
			|ОБЪЕДИНИТЬ ВСЕ
			|";
		КонецЕсли;
		ТекстВложенногоЗапроса = ТекстВложенногоЗапроса + ШаблонВложенногоЗапроса;
		
		ТекстВложенногоЗапроса = СтрЗаменить(ТекстВложенногоЗапроса , "%СтрокаВыборкаВложенногоЗапроса%", СтрокаВыборкаВложенногоЗапроса);
		ТекстВложенногоЗапроса = СтрЗаменить(ТекстВложенногоЗапроса , "%ОтветственноеЛицо%", 			  ПолучитьПолноеИмяПредопределенногоЗначения(КлючИЗначение.Значение));
		
		СтрокаВыборкаЗапроса = СтрокаВыборкаЗапроса + ",
		|	МАКСИМУМ(ВТДокументыСФИООтветственных." + КлючИЗначение.Ключ + ") КАК " + КлючИЗначение.Ключ + ",
		|	МАКСИМУМ(ВТДокументыСФИООтветственных." + КлючИЗначение.Ключ + "ПолноеФИО) КАК " + КлючИЗначение.Ключ + "ПолноеФИО,
		|	МАКСИМУМ(ВТДокументыСФИООтветственных." + КлючИЗначение.Ключ + "ФИО) КАК " + КлючИЗначение.Ключ + "ФИО";

	КонецЦикла;
	
	ТекстЗапроса = СтрЗаменить(ШаблонЗапроса , "%СтрокаВыборкаЗапроса%", СтрокаВыборкаЗапроса);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса ,  "%ВложенныйЗапрос%", 	 ТекстВложенногоЗапроса);
	
	Запрос.Текст = Запрос.Текст + ТекстЗапроса;
	
	// Расшифруем данные - выберем нужные реквизиты ответственных лиц в отдельные поля
	ШаблонЗапроса = "
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСвернутая.Ссылка КАК Ссылка%СтрокаВыборка%
	|ПОМЕСТИТЬ %ИмяТаблицыОтветственныеЛица%
	|ИЗ
	|	ВТДокументыСФИООтветственныхСвернутая КАК ВТСвернутая
	|";
	
	ШаблонСтрокиВыборки = ",
	|	ВТСвернутая.%Реквизит% КАК %Реквизит%,
	|	ЕСТЬNULL(ВТСвернутая.%Реквизит%.ФизическоеЛицо, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК %Реквизит%ФизическоеЛицо,
	|	ВТСвернутая.%Реквизит%ФИО КАК %Реквизит%Наименование,
	|	ВТСвернутая.%Реквизит%ПолноеФИО КАК %Реквизит%ПолноеФИО,	
	|	ЕСТЬNULL(ВТСвернутая.%Реквизит%.Должность, """") КАК %Реквизит%Должность,
	|	ЕСТЬNULL(ВТСвернутая.%Реквизит%.ОснованиеПраваПодписи, """") КАК %Реквизит%ОснованиеПраваПодписи";

	СтрокаВыборка = "";
	Для Каждого КлючИЗначение Из РеквизитыОтветственныеЛица Цикл
		СтрокаВыборка = СтрокаВыборка + СтрЗаменить(ШаблонСтрокиВыборки , "%Реквизит%", КлючИЗначение.Ключ);
	КонецЦикла;
	
	ТекстЗапроса = СтрЗаменить(ШаблонЗапроса , "%СтрокаВыборка%", СтрокаВыборка);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса , "%ИмяТаблицыОтветственныеЛица%", ИмяТаблицыОтветственныеЛица);
	
	// Удалим ненужные временные таблицы
	Запрос.Текст = Запрос.Текст + ТекстЗапроса + "
	|;
	|УНИЧТОЖИТЬ ВТДанныеДокументов
	|;
	|УНИЧТОЖИТЬ ВТНезаполненныеОтветственные
	|;
	|УНИЧТОЖИТЬ ВТОтветственныеПоУмолчанию
	|;
	|УНИЧТОЖИТЬ ВТКандидатыВОтветственныеПоУмолчанию
	|;
	|УНИЧТОЖИТЬ ВТДокументыСОтветственными
	|;
	|УНИЧТОЖИТЬ ВТПериодыФИОФизЛиц
	|;
	|УНИЧТОЖИТЬ ВТФИОФизЛиц
	|;
	|УНИЧТОЖИТЬ ВТДокументыСФИООтветственных
	|;
	|УНИЧТОЖИТЬ ВТДокументыСФИООтветственныхСвернутая
	|";
	
	Запрос.Выполнить();
	
КонецПроцедуры

//++ НЕ УТ

// Возвращает структуру, содержащую информацию об ответственных лицах организации для подсистемы зарплата и кадры.
//
// Параметры:
//		Организация - СправочникСсылка.Организации - Ссылка на организацию
//		Сведения - Строка - строка с идентификаторами, разделенными запятыми
//		ДатаСведений - Дата - Дата получения сведений.
//
// Возвращаемое значение:
//		Структура - структура со свойствами, совпадающими с параметром «Сведения»:
//			* Руководитель - руководитель организации
//			* ДолжностьРуководителя - должность руководителя
//			* ГлавныйБухгалтер - главбух организации
//			* Кассир - кассир организации
//			* ДолжностьКассира - должность кассира
//			* РуководительКадровойСлужбы - Руководитель кадровой службы
//			* ДолжностьРуководителяКадровойСлужбы - Должность руководителя кадровой службы
//			* ОтветственныйЗаВУР - Ответственный за ВУР
//			* ДолжностьОтветственногоЗаВУР - Должность ответственного за ВУР.
//
Функция СведенияОбОтветственныхЛицахЗарплатаИКадры(Организация, Сведения, Дата) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОтветственныеЛица = ПолучитьОтветственныеЛицаОрганизации(Организация, Дата);
	
	ЭтоСтруктура = ТипЗнч(Сведения) = Тип("Структура");
	
	Если ЭтоСтруктура Тогда
		Результат = Сведения;
	Иначе
		Результат = Новый Структура;
	КонецЕсли;
	
	Если СтрНайти(Сведения, "Руководитель") > 0 Или ЭтоСтруктура И Сведения.Свойство("Руководитель") Тогда
		Результат.Вставить("Руководитель", ОтветственныеЛица.Руководитель);
	КонецЕсли;
	
	Если СтрНайти(Сведения, "ДолжностьРуководителя") > 0 Или ЭтоСтруктура И Сведения.Свойство("ДолжностьРуководителя") Тогда
		Результат.Вставить("ДолжностьРуководителя", ОтветственныеЛица.РуководительДолжностьСсылка);
	КонецЕсли;
	
	Если СтрНайти(Сведения, "ДолжностьРуководителяСтрокой") > 0 Или ЭтоСтруктура И Сведения.Свойство("ДолжностьРуководителяСтрокой") Тогда
		Результат.Вставить("ДолжностьРуководителяСтрокой", ОтветственныеЛица.РуководительДолжность);
	КонецЕсли;
	
	Если СтрНайти(Сведения, "ГлавныйБухгалтер") > 0 Или ЭтоСтруктура И Сведения.Свойство("ГлавныйБухгалтер") Тогда
		Результат.Вставить("ГлавныйБухгалтер", ОтветственныеЛица.ГлавныйБухгалтер);
	КонецЕсли;
	
	Если СтрНайти(Сведения, "Кассир") > 0 Или ЭтоСтруктура И Сведения.Свойство("Кассир") Тогда
		Результат.Вставить("Кассир", ОтветственныеЛица.Кассир);
	КонецЕсли;
	
	Если СтрНайти(Сведения, "ДолжностьКассира") > 0 Или ЭтоСтруктура И Сведения.Свойство("ДолжностьКассира") Тогда
		Результат.Вставить("ДолжностьКассира", ОтветственныеЛица.КассирДолжностьСсылка);
	КонецЕсли;
	
	Если СтрНайти(Сведения, "ДолжностьКассираСтрокой") > 0 Или ЭтоСтруктура И Сведения.Свойство("ДолжностьКассираСтрокой") Тогда
		Результат.Вставить("ДолжностьКассираСтрокой", ОтветственныеЛица.КассирДолжность);
	КонецЕсли;

	Если СтрНайти(Сведения, "РуководительКадровойСлужбы") > 0 Или ЭтоСтруктура И Сведения.Свойство("РуководительКадровойСлужбы") Тогда
		Результат.Вставить("РуководительКадровойСлужбы", ОтветственныеЛица.РуководительКадровойСлужбы);
	КонецЕсли;
	
	Если СтрНайти(Сведения, "ДолжностьРуководителяКадровойСлужбы") > 0 Или ЭтоСтруктура И Сведения.Свойство("ДолжностьРуководителяКадровойСлужбы") Тогда
		Результат.Вставить("ДолжностьРуководителяКадровойСлужбы", ОтветственныеЛица.РуководительКадровойСлужбыДолжностьСсылка);
	КонецЕсли;
	
	Если СтрНайти(Сведения, "ДолжностьРуководителяКадровойСлужбыСтрокой") > 0 Или ЭтоСтруктура И Сведения.Свойство("ДолжностьРуководителяКадровойСлужбыСтрокой") Тогда
		Результат.Вставить("ДолжностьРуководителяКадровойСлужбыСтрокой", ОтветственныеЛица.РуководительКадровойСлужбыДолжность);
	КонецЕсли;
	
	Если СтрНайти(Сведения, "ОтветственныйЗаВУР") > 0 Или ЭтоСтруктура И Сведения.Свойство("ОтветственныйЗаВУР") Тогда
		Результат.Вставить("ОтветственныйЗаВУР", ОтветственныеЛица.ОтветственныйЗаВУР);
	КонецЕсли;
	
	Если СтрНайти(Сведения, "ДолжностьОтветственногоЗаВУР") > 0 Или ЭтоСтруктура И Сведения.Свойство("ДолжностьОтветственногоЗаВУР") Тогда
		Результат.Вставить("ДолжностьОтветственногоЗаВУР", ОтветственныеЛица.ОтветственныйЗаВУРДолжностьСсылка);
	КонецЕсли;
	
	Если СтрНайти(Сведения, "ДолжностьОтветственногоЗаВУРСтрокой") > 0 Или ЭтоСтруктура И Сведения.Свойство("ДолжностьОтветственногоЗаВУРСтрокой") Тогда
		Результат.Вставить("ДолжностьОтветственногоЗаВУРСтрокой", ОтветственныеЛица.ОтветственныйЗаВУРДолжность);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//-- НЕ УТ

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСобытийИзмененияОтветственныхЛиц

// Обработчик события "ПриИзменении" ключевых реквизитов документа (Дата, Организация).
// Проверяет соответствие ответственных лиц документа и ключевых реквизитов.
//
// Параметры:
//	РеквизитыДокумента - ДанныеФормыСтруктура - свойство "Объект" формы документа.
//
Процедура ПриИзмененииСвязанныхРеквизитовДокумента(Объект) Экспорт
	
	ЗаполнитьОтветственныхЛицДокумента(Объект,, Истина);
	
КонецПроцедуры


// Обработчик подписки на событие ОтветственныеЛицаДокументаОбработкаЗаполнения.
// Заполняет реквизиты ответственных лиц документа значениями по умолчанию.
//
// Параметры:
// 	Источник - ДокументОбъект -
// 	ДанныеЗаполнения - Произвольный -
// 	СтандартнаяОбработка - Булево - 
// 
Процедура ОтветственныеЛицаДокументаОбработкаЗаполнения(Источник, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если НЕ ОтветственныеЛицаПовтИсп.ЕстьРеквизитыОтветственныхЛицДокумента(Источник.Метаданные().Имя) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОтветственныхЛицДокумента(Источник, ДанныеЗаполнения);
	
КонецПроцедуры

// Обработчик подписки на событие ОтветственныеЛицаДокументаПриКопировании.
// Заполняет реквизиты ответственных лиц документа значениями по умолчанию.
//
// Параметры:
// 	Источник - ДокументОбъект -
// 	ОбъектКопирования - ДокументОбъект -
// 
Процедура ОтветственныеЛицаДокументаПриКопировании(Источник, ОбъектКопирования) Экспорт
	
	Если НЕ ОтветственныеЛицаПовтИсп.ЕстьРеквизитыОтветственныхЛицДокумента(Источник.Метаданные().Имя) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОтветственныхЛицДокумента(Источник, ОбъектКопирования);
	
КонецПроцедуры

// Обработчик подписки на событие ОтветственныеЛицаДокументаОбработкаПроверкиЗаполнения.
// Проверяет корректность заполнения реквизитов ответственных лиц документа.
//
// Параметры:
// 	Источник - ДокументОбъект -
// 	Отказ - Булево -
// 	ПроверяемыеРеквизиты - Массив Из Строка -
//
Процедура ОтветственныеЛицаДокументаОбработкаПроверкиЗаполнения(Источник, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	Если НЕ ОтветственныеЛицаПовтИсп.ЕстьРеквизитыОтветственныхЛицДокумента(Источник.Метаданные().Имя) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДанныхОтветственныхЛиц = СтруктураДанныхОтветственныхЛицДокумента(Источник);
	
	РеквизитыОтветственныеЛица = СтруктураДанныхОтветственныхЛиц.РеквизитыОтветственныеЛица;
	
	Для Каждого КлючИЗначение Из РеквизитыОтветственныеЛица Цикл
		
		ЗначениеОтветственногоЛица = СтруктураДанныхОтветственныхЛиц[КлючИЗначение.Ключ];
		Если ЗначениеЗаполнено(ЗначениеОтветственногоЛица) Тогда
			
			РеквизитыДляПроверки =
				Новый Структура(
					"Дата, Организация, ОтветственноеЛицо",
					СтруктураДанныхОтветственныхЛиц.Дата, СтруктураДанныхОтветственныхЛиц.Организация, КлючИЗначение.Значение);
			
			// Если реквизит заполнен некорректно - сообщим пользователю и установим параметр Отказ = Истина.
			Если НЕ ПроверитьСоответствиеРеквизитовИОтветственногоЛица(РеквизитыДляПроверки, ЗначениеОтветственногоЛица) Тогда
				
				ПредставлениеРеквизита = Источник.Метаданные().Реквизиты.Найти(КлючИЗначение.Ключ).Синоним;
				
				СообщениеОбОшибке = НСтр("ru='Ответственное лицо ""%ПредставлениеРеквизита%"" не имеет права подписи этого документа.';uk='Відповідальна особа ""%ПредставлениеРеквизита%"" не має права підпису цього документа.'");
				СообщениеОбОшибке = СтрЗаменить(СообщениеОбОшибке, "%ПредставлениеРеквизита%", ПредставлениеРеквизита); 

				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СообщениеОбОшибке,
					,
					"Объект." + КлючИЗначение.Ключ,
					,
					Отказ);
				
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеСлужебныеПроцедуры

// Формирует структуру, содержащую информацию об ответственных лицах документа
//	
//	Параметры:
//		Объект - ДокументОбъект, ДанныеФормыСтруктура - объект, для которого нужно получить данные
//	Возвращаемое значение:
//		Структура - С ключами:
//			* РеквизитыОтветственныеЛица - структура - ключ - имя реквизита документа, хранящего информацию об ответственном лице
//													- значение - ПеречислениеСсылка.ОтветственныеЛицаОрганизаций - "вид" ответственного лица
//			* Ссылка - ДокументСсылка -
//			* Дата   - Дата - дата документа
//          * Организация - СправочникСсылка.Организации - организация, для которой нужно получать ответственных лиц
//          <ИмяРеквизитаОтветственногоЛица> - СправочникСсылка.ОтветственныеЛицаОрганизаций - текущие ответственные
//              лица, указанные в документе.
//			
Функция СтруктураДанныхОтветственныхЛицДокумента(Объект)
	
	СтруктураДанных = Новый Структура("Ссылка, Дата, Организация");
	СтруктураДанных.Вставить(
		"РеквизитыОтветственныеЛица",
		ОтветственныеЛицаПовтИсп.РеквизитыОтветственныхЛицДокумента(Объект.Ссылка.Метаданные().Имя));
	
	Для Каждого ЭлементСтруктуры Из СтруктураДанных.РеквизитыОтветственныеЛица Цикл
		СтруктураДанных.Вставить(ЭлементСтруктуры.Ключ);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(СтруктураДанных, Объект);
	
	Возврат СтруктураДанных;
	
КонецФункции

// Проверяет соответствие ответственного лица и ключевых реквизитов документа.
//
// Параметры:
//	РеквизитыДляПроверки - Структура - структура реквизитов документа с ключами:
//		* Дата
//		* Организация
//		* ОтветственноеЛицо - "вид" ответственного лица
//		* ПометкаУдаления - необязательный, проверять пометку удаления ответственного лица
//	ОтветственноеЛицоДляПроверки - СправочникСсылка.ОтветственныеЛицаОрганизаций - ответственное лицо.
//
// Возвращаемое значение:
//	Булево - результат проверки
//
Функция ПроверитьСоответствиеРеквизитовИОтветственногоЛица(РеквизитыДляПроверки, ОтветственноеЛицоДляПроверки)
	
	Если НЕ ЗначениеЗаполнено(ОтветственноеЛицоДляПроверки) Тогда
		Возврат Истина;
	КонецЕсли;
	
	РеквизитыОтветственногоЛица =
		ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ОтветственноеЛицоДляПроверки,
			"Владелец, ОтветственноеЛицо, ДатаНачала, ДатаОкончания, ПометкаУдаления"); 
	
	Дата = НачалоДня(РеквизитыДляПроверки.Дата);
	
	Если РеквизитыОтветственногоЛица.Владелец <> РеквизитыДляПроверки.Организация
	 Или РеквизитыОтветственногоЛица.ОтветственноеЛицо <> РеквизитыДляПроверки.ОтветственноеЛицо
	 Или РеквизитыОтветственногоЛица.ДатаНачала > Дата
	 Или (ЗначениеЗаполнено(РеквизитыОтветственногоЛица.ДатаОкончания) И РеквизитыОтветственногоЛица.ДатаОкончания < Дата)
	 Или (РеквизитыДляПроверки.Свойство("ПометкаУдаления")
	 		И РеквизитыОтветственногоЛица.ПометкаУдаления <> РеквизитыДляПроверки.ПометкаУдаления) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Проверяет соответствие значений реквизитов ответственных лиц документа и ключевых реквизитов документа.
// Если значения не соответствуют то процедура подбирает подходящее значение для ответственного лица.
// Параметры:
// 	РеквизитыДокумента - ДокументОбъект, Структура - данные документа
//		- ключевые реквизиты (Дата, Организация, Ссылка)
//		- реквизиты ответственных лиц.
//
// Возвращаемое значение:
//  Структура - структура измененных реквизитов ответственных лиц документа
//		Ключ 	 - имя измененного реквизита документа
//		Значение - новое значение реквизита.
//
Функция СкорректироватьОтветственныхЛицДокумента(СтруктураДанныхОтветственныхЛиц)
	
	ИзмененныеРеквизиты = Новый Структура;
	
	РеквизитыОтветственныеЛица = СтруктураДанныхОтветственныхЛиц.РеквизитыОтветственныеЛица;
	Дата = ?(ЗначениеЗаполнено(СтруктураДанныхОтветственныхЛиц.Дата), СтруктураДанныхОтветственныхЛиц.Дата, ТекущаяДатаСеанса());
	
	ТаблицаОтветственных = ПолучитьТаблицуОтветственныхЛицПоОтбору(
		Новый Структура("Дата, Организация", Дата, СтруктураДанныхОтветственныхЛиц.Организация));
	
	Для Каждого КлючИЗначение Из РеквизитыОтветственныеЛица Цикл
		
		ЗначениеОтветственногоЛица = СтруктураДанныхОтветственныхЛиц[КлючИЗначение.Ключ];
		
		РеквизитыДляПроверки = Новый Структура;
		РеквизитыДляПроверки.Вставить("Дата", 			   Дата);
		РеквизитыДляПроверки.Вставить("Организация", 	   СтруктураДанныхОтветственныхЛиц.Организация);
		РеквизитыДляПроверки.Вставить("ОтветственноеЛицо", КлючИЗначение.Значение);
		РеквизитыДляПроверки.Вставить("ПометкаУдаления",   Ложь);
		
		// Если выбрано неподходящее ответственное лицо, то очистим его
		Если ЗначениеЗаполнено(ЗначениеОтветственногоЛица)
		 И Не ПроверитьСоответствиеРеквизитовИОтветственногоЛица(РеквизитыДляПроверки, ЗначениеОтветственногоЛица) Тогда
			ЗначениеОтветственногоЛица = Справочники.ОтветственныеЛицаОрганизаций.ПустаяСсылка();
		КонецЕсли;
		
		// Если ответственное лицо не выбрано, то попытаемся подобрать его
		Если Не ЗначениеЗаполнено(ЗначениеОтветственногоЛица) Тогда
			СтрокиТаблицы = ТаблицаОтветственных.НайтиСтроки(Новый Структура("ОтветственноеЛицо", КлючИЗначение.Значение));
			Если СтрокиТаблицы.Количество() = 1 Тогда
				ЗначениеОтветственногоЛица = СтрокиТаблицы[0].Ссылка; // можно однозначно определить ответственного
			КонецЕсли;
		КонецЕсли;
		
		// Запомним изменение реквизита
		Если СтруктураДанныхОтветственныхЛиц[КлючИЗначение.Ключ] <> ЗначениеОтветственногоЛица Тогда
			ИзмененныеРеквизиты.Вставить(КлючИЗначение.Ключ, ЗначениеОтветственногоЛица);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ИзмененныеРеквизиты;
	
КонецФункции

// Заполняет значения ответственных лиц документа значениями по умолчанию.
//
// Параметры:
//	Объект - ДокументОбъект - документ, реквизиты которого необходимо заполнить:
//  	* ДополнительныеСвойства - Структура - Дополнительные свойства объекта:
//  		** ОтключитьЗаполнениеОбъектаПоСтатистике - Булево - Истина, если необходимо отключить заполнение реквизитов по статистике.
//  		                                                     Например, в сценарии загрузки объектов из другой системы.
//         - ДанныеФормыСтруктура - данные документа при вызове из формы.
//	ДанныеЗаполнения - Произвольный - объект, содержащий данные для заполнения документа.
//	ПерезаполнятьНепустыеРеквизиты - Булево - необходимость перезаполнения реквизитов даже тогда, когда они уже содержат значения.
//
Процедура ЗаполнитьОтветственныхЛицДокумента(Объект, ДанныеЗаполнения = Неопределено, ПерезаполнятьНепустыеРеквизиты = Ложь)
	
	СтруктураДанныхОтветственныхЛиц = СтруктураДанныхОтветственныхЛицДокумента(Объект);
	
	// Заполним пустые реквизиты непустыми значениями из данных для заполнения, при этом
	// - не заполняем системные реквизиты
	// - не берем дату (в случае копирования документа или ввода на основании).
	Если ДанныеЗаполнения <> Неопределено Тогда
		
		Для Каждого КлючИЗначение Из СтруктураДанныхОтветственныхЛиц Цикл
			
			Если КлючИЗначение.Ключ = "РеквизитыОтветственныеЛица"
			 ИЛИ КлючИЗначение.Ключ = "Ссылка"
			 ИЛИ (КлючИЗначение.Ключ = "Дата" И ТипЗнч(ДанныеЗаполнения) <> Тип("Структура"))
			 ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("Строка") // автотестирование
			 ИЛИ ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаполняемыйРеквизит = Новый Структура(КлючИЗначение.Ключ);
			ЗаполнитьЗначенияСвойств(ЗаполняемыйРеквизит, ДанныеЗаполнения);
			Если ЗначениеЗаполнено(ЗаполняемыйРеквизит[КлючИЗначение.Ключ]) Тогда
				ЗаполнитьЗначенияСвойств(СтруктураДанныхОтветственныхЛиц, ЗаполняемыйРеквизит);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаполнитьРеквизитыОтветственныхЛицПоСтатистике(СтруктураДанныхОтветственныхЛиц, Объект, ПерезаполнятьНепустыеРеквизиты);
	
	// Проверим соответствие ответственных лиц дате и организации документа.
	// Если не соответствует - заполним ответственными лицами по умолчанию.
	ИзмененныеРеквизиты = СкорректироватьОтветственныхЛицДокумента(СтруктураДанныхОтветственныхЛиц);
	ЗаполнитьЗначенияСвойств(СтруктураДанныхОтветственныхЛиц, ИзмененныеРеквизиты);
	
	// Перенесем реквизиты в объект
	ЗаполнитьЗначенияСвойств(Объект, СтруктураДанныхОтветственныхЛиц, , "Ссылка, Дата");
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыОтветственныхЛицПоСтатистике(СтруктураДанныхОтветственныхЛиц, Объект, ПерезаполнятьНепустыеРеквизиты)
	
	Если ТипЗнч(Объект) <> Тип("ДанныеФормыСтруктура")
		И Объект.ДополнительныеСвойства.Свойство("ОтключитьЗаполнениеОбъектаПоСтатистике")
		И Объект.ДополнительныеСвойства.ОтключитьЗаполнениеОбъектаПоСтатистике Тогда
		Возврат;
	КонецЕсли;
	
	// Получим значения реквизитов ответственных лиц по статистике
	ОписаниеРеквизитов = Новый Структура;
	Параметры = ЗаполнениеОбъектовПоСтатистике.ПараметрыЗаполняемыхРеквизитов();
	Параметры.РазрезыСбораСтатистики.ИспользоватьТолькоЗаполненные = "Организация";
	Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Объект, "Автор") Тогда
		Параметры.РазрезыСбораСтатистики.ИспользоватьВсегда = "Автор";
		Параметры.ЗаполнятьПриУсловии.ПоляОбъектаЗаполнены = "Автор";
	КонецЕсли;
	Для Каждого Реквизит Из СтруктураДанныхОтветственныхЛиц.РеквизитыОтветственныеЛица Цикл
		ЗаполнениеОбъектовПоСтатистике.ДобавитьОписаниеЗаполняемыхРеквизитов(ОписаниеРеквизитов, Реквизит.Ключ, Параметры);
	КонецЦикла;
	РеквизитыДляОтбора = Новый Структура("Организация", СтруктураДанныхОтветственныхЛиц.Организация);
	ЗаполняемыеРеквизиты = ЗаполнениеОбъектовПоСтатистике.ПолучитьЗначенияРеквизитов(
		СтруктураДанныхОтветственныхЛиц.Ссылка, ОписаниеРеквизитов, РеквизитыДляОтбора);
	
	Для Каждого КлючИЗначение Из СтруктураДанныхОтветственныхЛиц.РеквизитыОтветственныеЛица Цикл
		Если (ПерезаполнятьНепустыеРеквизиты ИЛИ НЕ ЗначениеЗаполнено(СтруктураДанныхОтветственныхЛиц[КлючИЗначение.Ключ]))
		 И ЗначениеЗаполнено(ЗаполняемыеРеквизиты[КлючИЗначение.Ключ]) Тогда
			СтруктураДанныхОтветственныхЛиц[КлючИЗначение.Ключ] = ЗаполняемыеРеквизиты[КлючИЗначение.Ключ];
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#КонецОбласти
